Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateOpeningRectangularArcWall Property
 Creation of a Rectangular Arc Wall Opening failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateOpeningRectangularArcWall { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateOpeningRectangularArcWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateOpeningRectangularArcWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace